#!/usr/bin/env python
# -*- coding: utf-8 -*-

SPECIAL = [
        # name, spicy, kal, color, price, effect, state
        (u'カレー', 1.0, 100, (128, 128, 0), 100, u'おいしそうな においが する', u'普通のカレーに なった！'),
        (u'うんこ', 1.0, 500, (10, 10, 10), 100, u'しかし だれも きづいていない...', u'（へんな においが する...）'),
        (u'まどか', 1.0, 500, (10, 10, 10), 100, u'こんなの、絶対おかしいよ！', u''),
        (u'巴マミ', 1.0, 500, (10, 10, 10), 100, u'もう何も怖くない！', u''),
        (u'QB', 1.0, 500, (10, 10, 10), 100, u'わけがわからないよ！', u''),
        (u'エルシャダイ', 1.0, 500, (10, 10, 10), 100, u'大丈夫だ、問題ない', u'一番いいの頼む！'),
        ]

BANNED = [
        u'俺',
        u'私',
        u'わたし',
        u'僕',
        u'あなた',
        u'君',
        u'こと',
        u'なう',
        u'ナウ',
        u'自分',
        ]
